; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	spectrograph0 - mode
	spectrograph2 - mode
	infrared3 - mode
	spectrograph1 - mode
	thermograph4 - mode
	GroundStation12 - direction
	GroundStation24 - direction
	GroundStation44 - direction
	Star47 - direction
	Star35 - direction
	Star11 - direction
	Star23 - direction
	GroundStation49 - direction
	GroundStation2 - direction
	GroundStation9 - direction
	GroundStation16 - direction
	Star56 - direction
	GroundStation14 - direction
	GroundStation51 - direction
	GroundStation18 - direction
	Star53 - direction
	GroundStation5 - direction
	Star29 - direction
	GroundStation4 - direction
	Star1 - direction
	Star13 - direction
	Star8 - direction
	Star30 - direction
	Star32 - direction
	Star15 - direction
	GroundStation36 - direction
	GroundStation57 - direction
	Star45 - direction
	Star0 - direction
	Star59 - direction
	Star54 - direction
	GroundStation34 - direction
	GroundStation31 - direction
	Star50 - direction
	Star40 - direction
	Star38 - direction
	GroundStation27 - direction
	Star7 - direction
	Star43 - direction
	Star19 - direction
	GroundStation33 - direction
	GroundStation46 - direction
	Star58 - direction
	GroundStation17 - direction
	GroundStation48 - direction
	GroundStation28 - direction
	GroundStation21 - direction
	Star52 - direction
	GroundStation3 - direction
	Star20 - direction
	GroundStation22 - direction
	GroundStation26 - direction
	Star39 - direction
	Star10 - direction
	Star55 - direction
	GroundStation42 - direction
	Star41 - direction
	Star25 - direction
	Star6 - direction
	GroundStation37 - direction
	Phenomenon60 - direction
	Planet61 - direction
	Star62 - direction
	Planet63 - direction
	Phenomenon64 - direction
	Star65 - direction
	Star66 - direction
	Planet67 - direction
	Phenomenon68 - direction
	Phenomenon69 - direction
	Star70 - direction
	Planet71 - direction
	Phenomenon72 - direction
	Planet73 - direction
	Phenomenon74 - direction
	Phenomenon75 - direction
	Planet76 - direction
	Phenomenon77 - direction
	Phenomenon78 - direction
	Planet79 - direction
	Planet80 - direction
	Phenomenon81 - direction
	Star82 - direction
	Planet83 - direction
	Star84 - direction
	Phenomenon85 - direction
	Phenomenon86 - direction
	Star87 - direction
	Phenomenon88 - direction
	Planet89 - direction
	Star90 - direction
	Phenomenon91 - direction
	Planet92 - direction
	Star93 - direction
	Phenomenon94 - direction
	Star95 - direction
	Star96 - direction
	Star97 - direction
	Star98 - direction
	Planet99 - direction
	Planet100 - direction
	Planet101 - direction
	Planet102 - direction
	Star103 - direction
	Phenomenon104 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 GroundStation21)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star70)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation34)
	(calibration_target instrument1 Star39)
	(calibration_target instrument1 Star50)
	(calibration_target instrument1 GroundStation42)
	(calibration_target instrument1 Star15)
	(calibration_target instrument1 GroundStation24)
	(calibration_target instrument1 GroundStation57)
	(calibration_target instrument1 Star55)
	(calibration_target instrument1 Star40)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation48)
	(calibration_target instrument1 Star45)
	(calibration_target instrument1 Star54)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star30)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation12)
	(calibration_target instrument1 Star53)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation16)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star20)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 Star19)
	(calibration_target instrument2 GroundStation36)
	(calibration_target instrument2 GroundStation27)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation48)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation44)
	(calibration_target instrument2 Star54)
	(calibration_target instrument2 Star55)
	(calibration_target instrument2 Star53)
	(supports instrument3 thermograph4)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star13)
	(calibration_target instrument3 GroundStation48)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 Star58)
	(calibration_target instrument3 Star23)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 Star35)
	(calibration_target instrument3 GroundStation26)
	(calibration_target instrument3 GroundStation14)
	(calibration_target instrument3 GroundStation34)
	(calibration_target instrument3 Star19)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation51)
	(calibration_target instrument3 GroundStation17)
	(calibration_target instrument3 Star47)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star53)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star32)
	(calibration_target instrument4 GroundStation16)
	(calibration_target instrument4 GroundStation14)
	(calibration_target instrument4 Star50)
	(calibration_target instrument4 GroundStation22)
	(calibration_target instrument4 Star10)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 GroundStation57)
	(calibration_target instrument4 GroundStation26)
	(calibration_target instrument4 GroundStation42)
	(calibration_target instrument4 Star41)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation49)
	(calibration_target instrument4 GroundStation28)
	(calibration_target instrument4 GroundStation21)
	(calibration_target instrument4 Star29)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star10)
	(calibration_target instrument5 Star54)
	(calibration_target instrument5 GroundStation16)
	(calibration_target instrument5 GroundStation21)
	(calibration_target instrument5 GroundStation22)
	(calibration_target instrument5 Star52)
	(calibration_target instrument5 Star53)
	(calibration_target instrument5 Star56)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 GroundStation9)
	(calibration_target instrument5 Star40)
	(supports instrument6 thermograph4)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation18)
	(calibration_target instrument6 GroundStation37)
	(calibration_target instrument6 Star38)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 Star29)
	(calibration_target instrument6 Star8)
	(calibration_target instrument6 GroundStation51)
	(calibration_target instrument6 GroundStation28)
	(calibration_target instrument6 Star32)
	(calibration_target instrument6 Star20)
	(calibration_target instrument6 GroundStation14)
	(calibration_target instrument6 Star30)
	(calibration_target instrument6 Star58)
	(calibration_target instrument6 GroundStation33)
	(calibration_target instrument6 GroundStation22)
	(calibration_target instrument6 Star56)
	(calibration_target instrument6 Star1)
	(calibration_target instrument6 GroundStation21)
	(supports instrument7 spectrograph2)
	(supports instrument7 thermograph4)
	(calibration_target instrument7 GroundStation34)
	(calibration_target instrument7 Star53)
	(calibration_target instrument7 Star13)
	(calibration_target instrument7 Star29)
	(calibration_target instrument7 Star54)
	(calibration_target instrument7 GroundStation17)
	(supports instrument8 infrared3)
	(supports instrument8 spectrograph1)
	(supports instrument8 thermograph4)
	(calibration_target instrument8 GroundStation3)
	(calibration_target instrument8 GroundStation4)
	(calibration_target instrument8 Star29)
	(calibration_target instrument8 GroundStation5)
	(calibration_target instrument8 GroundStation26)
	(calibration_target instrument8 Star7)
	(calibration_target instrument8 GroundStation57)
	(calibration_target instrument8 Star54)
	(calibration_target instrument8 Star59)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation31)
	(supports instrument9 thermograph4)
	(calibration_target instrument9 Star58)
	(calibration_target instrument9 Star45)
	(calibration_target instrument9 Star6)
	(calibration_target instrument9 GroundStation57)
	(calibration_target instrument9 GroundStation36)
	(calibration_target instrument9 Star15)
	(calibration_target instrument9 Star38)
	(calibration_target instrument9 Star32)
	(calibration_target instrument9 Star30)
	(calibration_target instrument9 Star19)
	(calibration_target instrument9 GroundStation33)
	(calibration_target instrument9 Star8)
	(calibration_target instrument9 GroundStation3)
	(calibration_target instrument9 Star25)
	(calibration_target instrument9 Star13)
	(calibration_target instrument9 Star1)
	(supports instrument10 spectrograph2)
	(calibration_target instrument10 Star40)
	(calibration_target instrument10 Star20)
	(calibration_target instrument10 Star50)
	(calibration_target instrument10 GroundStation31)
	(calibration_target instrument10 Star55)
	(calibration_target instrument10 GroundStation34)
	(calibration_target instrument10 Star7)
	(calibration_target instrument10 GroundStation33)
	(calibration_target instrument10 GroundStation17)
	(calibration_target instrument10 Star54)
	(calibration_target instrument10 Star59)
	(calibration_target instrument10 Star0)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon78)
	(supports instrument11 spectrograph1)
	(calibration_target instrument11 GroundStation21)
	(calibration_target instrument11 GroundStation28)
	(calibration_target instrument11 Star52)
	(calibration_target instrument11 Star20)
	(calibration_target instrument11 GroundStation48)
	(calibration_target instrument11 GroundStation17)
	(calibration_target instrument11 Star25)
	(calibration_target instrument11 Star58)
	(calibration_target instrument11 GroundStation46)
	(calibration_target instrument11 GroundStation33)
	(calibration_target instrument11 Star19)
	(calibration_target instrument11 Star43)
	(calibration_target instrument11 Star7)
	(calibration_target instrument11 GroundStation27)
	(calibration_target instrument11 Star38)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 GroundStation37)
	(calibration_target instrument12 Star6)
	(calibration_target instrument12 Star25)
	(calibration_target instrument12 Star41)
	(calibration_target instrument12 GroundStation42)
	(calibration_target instrument12 Star55)
	(calibration_target instrument12 Star10)
	(calibration_target instrument12 Star39)
	(calibration_target instrument12 GroundStation26)
	(calibration_target instrument12 GroundStation22)
	(calibration_target instrument12 Star20)
	(calibration_target instrument12 GroundStation3)
	(calibration_target instrument12 Star52)
	(calibration_target instrument12 GroundStation21)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star54)
)
(:goal (and
	(pointing satellite0 Phenomenon72)
	(pointing satellite3 GroundStation44)
	(have_image Phenomenon60 spectrograph2)
	(have_image Planet61 infrared3)
	(have_image Star62 spectrograph0)
	(have_image Planet63 infrared3)
	(have_image Phenomenon64 infrared3)
	(have_image Star65 thermograph4)
	(have_image Star66 spectrograph1)
	(have_image Planet67 thermograph4)
	(have_image Phenomenon68 infrared3)
	(have_image Phenomenon69 spectrograph1)
	(have_image Star70 spectrograph1)
	(have_image Planet71 thermograph4)
	(have_image Phenomenon72 infrared3)
	(have_image Planet73 infrared3)
	(have_image Phenomenon74 thermograph4)
	(have_image Phenomenon75 spectrograph2)
	(have_image Planet76 spectrograph0)
	(have_image Phenomenon77 spectrograph0)
	(have_image Phenomenon78 spectrograph1)
	(have_image Planet79 spectrograph1)
	(have_image Planet80 spectrograph0)
	(have_image Phenomenon81 spectrograph1)
	(have_image Star82 spectrograph2)
	(have_image Planet83 spectrograph0)
	(have_image Star84 infrared3)
	(have_image Phenomenon85 spectrograph0)
	(have_image Phenomenon86 thermograph4)
	(have_image Star87 spectrograph1)
	(have_image Phenomenon88 spectrograph1)
	(have_image Planet89 thermograph4)
	(have_image Star90 thermograph4)
	(have_image Phenomenon91 spectrograph1)
	(have_image Planet92 infrared3)
	(have_image Star93 spectrograph0)
	(have_image Phenomenon94 spectrograph1)
	(have_image Star95 infrared3)
	(have_image Star96 spectrograph2)
	(have_image Star97 thermograph4)
	(have_image Star98 spectrograph1)
	(have_image Planet99 thermograph4)
	(have_image Planet100 spectrograph2)
	(have_image Planet101 spectrograph0)
	(have_image Planet102 infrared3)
	(have_image Star103 spectrograph2)
	(have_image Phenomenon104 spectrograph2)
))

)

; plan
1. (switch_on instrument11 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument11)
   goals met: 0 of 47
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 47
3. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 47
4. (calibrate satellite2 instrument2 star53)
   added: (calibrated instrument2)
   goals met: 0 of 47
5. (turn_to satellite5 phenomenon69 star54)
   deleted: (pointing satellite5 star54)
   added: (pointing satellite5 phenomenon69)
   goals met: 0 of 47
6. (turn_to satellite3 groundstation44 groundstation31)
   deleted: (pointing satellite3 groundstation31)
   added: (pointing satellite3 groundstation44)
   goals met: 1 of 47
7. (turn_to satellite2 phenomenon64 star53)
   deleted: (pointing satellite2 star53)
   added: (pointing satellite2 phenomenon64)
   goals met: 1 of 47
8. (take_image satellite2 phenomenon64 instrument2 infrared3)
   added: (have_image phenomenon64 infrared3)
   goals met: 2 of 47
9. (turn_to satellite2 phenomenon68 phenomenon64)
   deleted: (pointing satellite2 phenomenon64)
   added: (pointing satellite2 phenomenon68)
   goals met: 2 of 47
10. (take_image satellite2 phenomenon68 instrument2 infrared3)
   added: (have_image phenomenon68 infrared3)
   goals met: 3 of 47
11. (turn_to satellite2 phenomenon72 phenomenon68)
   deleted: (pointing satellite2 phenomenon68)
   added: (pointing satellite2 phenomenon72)
   goals met: 3 of 47
12. (take_image satellite2 phenomenon72 instrument2 infrared3)
   added: (have_image phenomenon72 infrared3)
   goals met: 4 of 47
13. (turn_to satellite2 phenomenon77 phenomenon72)
   deleted: (pointing satellite2 phenomenon72)
   added: (pointing satellite2 phenomenon77)
   goals met: 4 of 47
14. (take_image satellite2 phenomenon77 instrument2 spectrograph0)
   added: (have_image phenomenon77 spectrograph0)
   goals met: 5 of 47
15. (turn_to satellite2 phenomenon85 phenomenon77)
   deleted: (pointing satellite2 phenomenon77)
   added: (pointing satellite2 phenomenon85)
   goals met: 5 of 47
16. (take_image satellite2 phenomenon85 instrument2 spectrograph0)
   added: (have_image phenomenon85 spectrograph0)
   goals met: 6 of 47
17. (turn_to satellite2 planet101 phenomenon85)
   deleted: (pointing satellite2 phenomenon85)
   added: (pointing satellite2 planet101)
   goals met: 6 of 47
18. (take_image satellite2 planet101 instrument2 spectrograph0)
   added: (have_image planet101 spectrograph0)
   goals met: 7 of 47
19. (turn_to satellite2 planet102 planet101)
   deleted: (pointing satellite2 planet101)
   added: (pointing satellite2 planet102)
   goals met: 7 of 47
20. (take_image satellite2 planet102 instrument2 infrared3)
   added: (have_image planet102 infrared3)
   goals met: 8 of 47
21. (turn_to satellite2 planet61 planet102)
   deleted: (pointing satellite2 planet102)
   added: (pointing satellite2 planet61)
   goals met: 8 of 47
22. (take_image satellite2 planet61 instrument2 infrared3)
   added: (have_image planet61 infrared3)
   goals met: 9 of 47
23. (turn_to satellite2 planet63 planet61)
   deleted: (pointing satellite2 planet61)
   added: (pointing satellite2 planet63)
   goals met: 9 of 47
24. (take_image satellite2 planet63 instrument2 infrared3)
   added: (have_image planet63 infrared3)
   goals met: 10 of 47
25. (turn_to satellite2 planet73 planet63)
   deleted: (pointing satellite2 planet63)
   added: (pointing satellite2 planet73)
   goals met: 10 of 47
26. (take_image satellite2 planet73 instrument2 infrared3)
   added: (have_image planet73 infrared3)
   goals met: 11 of 47
27. (turn_to satellite2 planet76 planet73)
   deleted: (pointing satellite2 planet73)
   added: (pointing satellite2 planet76)
   goals met: 11 of 47
28. (take_image satellite2 planet76 instrument2 spectrograph0)
   added: (have_image planet76 spectrograph0)
   goals met: 12 of 47
29. (turn_to satellite2 planet80 planet76)
   deleted: (pointing satellite2 planet76)
   added: (pointing satellite2 planet80)
   goals met: 12 of 47
30. (take_image satellite2 planet80 instrument2 spectrograph0)
   added: (have_image planet80 spectrograph0)
   goals met: 13 of 47
31. (turn_to satellite2 planet83 planet80)
   deleted: (pointing satellite2 planet80)
   added: (pointing satellite2 planet83)
   goals met: 13 of 47
32. (take_image satellite2 planet83 instrument2 spectrograph0)
   added: (have_image planet83 spectrograph0)
   goals met: 14 of 47
33. (turn_to satellite2 planet92 planet83)
   deleted: (pointing satellite2 planet83)
   added: (pointing satellite2 planet92)
   goals met: 14 of 47
34. (take_image satellite2 planet92 instrument2 infrared3)
   added: (have_image planet92 infrared3)
   goals met: 15 of 47
35. (turn_to satellite2 star62 planet92)
   deleted: (pointing satellite2 planet92)
   added: (pointing satellite2 star62)
   goals met: 15 of 47
36. (take_image satellite2 star62 instrument2 spectrograph0)
   added: (have_image star62 spectrograph0)
   goals met: 16 of 47
37. (turn_to satellite2 star84 star62)
   deleted: (pointing satellite2 star62)
   added: (pointing satellite2 star84)
   goals met: 16 of 47
38. (take_image satellite2 star84 instrument2 infrared3)
   added: (have_image star84 infrared3)
   goals met: 17 of 47
39. (turn_to satellite2 star93 star84)
   deleted: (pointing satellite2 star84)
   added: (pointing satellite2 star93)
   goals met: 17 of 47
40. (take_image satellite2 star93 instrument2 spectrograph0)
   added: (have_image star93 spectrograph0)
   goals met: 18 of 47
41. (turn_to satellite2 star95 star93)
   deleted: (pointing satellite2 star93)
   added: (pointing satellite2 star95)
   goals met: 18 of 47
42. (take_image satellite2 star95 instrument2 infrared3)
   added: (have_image star95 infrared3)
   goals met: 19 of 47
43. (turn_to satellite0 phenomenon72 star70)
   deleted: (pointing satellite0 star70)
   added: (pointing satellite0 phenomenon72)
   goals met: 20 of 47
44. (turn_to satellite5 star7 phenomenon69)
   deleted: (pointing satellite5 phenomenon69)
   added: (pointing satellite5 star7)
   goals met: 20 of 47
45. (calibrate satellite5 instrument11 star7)
   added: (calibrated instrument11)
   goals met: 20 of 47
46. (turn_to satellite5 phenomenon69 star7)
   deleted: (pointing satellite5 star7)
   added: (pointing satellite5 phenomenon69)
   goals met: 20 of 47
47. (take_image satellite5 phenomenon69 instrument11 spectrograph1)
   added: (have_image phenomenon69 spectrograph1)
   goals met: 21 of 47
48. (turn_to satellite5 phenomenon78 phenomenon69)
   deleted: (pointing satellite5 phenomenon69)
   added: (pointing satellite5 phenomenon78)
   goals met: 21 of 47
49. (take_image satellite5 phenomenon78 instrument11 spectrograph1)
   added: (have_image phenomenon78 spectrograph1)
   goals met: 22 of 47
50. (turn_to satellite5 phenomenon81 phenomenon78)
   deleted: (pointing satellite5 phenomenon78)
   added: (pointing satellite5 phenomenon81)
   goals met: 22 of 47
51. (take_image satellite5 phenomenon81 instrument11 spectrograph1)
   added: (have_image phenomenon81 spectrograph1)
   goals met: 23 of 47
52. (turn_to satellite5 phenomenon88 phenomenon81)
   deleted: (pointing satellite5 phenomenon81)
   added: (pointing satellite5 phenomenon88)
   goals met: 23 of 47
53. (take_image satellite5 phenomenon88 instrument11 spectrograph1)
   added: (have_image phenomenon88 spectrograph1)
   goals met: 24 of 47
54. (turn_to satellite5 phenomenon91 phenomenon88)
   deleted: (pointing satellite5 phenomenon88)
   added: (pointing satellite5 phenomenon91)
   goals met: 24 of 47
55. (take_image satellite5 phenomenon91 instrument11 spectrograph1)
   added: (have_image phenomenon91 spectrograph1)
   goals met: 25 of 47
56. (turn_to satellite5 phenomenon94 phenomenon91)
   deleted: (pointing satellite5 phenomenon91)
   added: (pointing satellite5 phenomenon94)
   goals met: 25 of 47
57. (take_image satellite5 phenomenon94 instrument11 spectrograph1)
   added: (have_image phenomenon94 spectrograph1)
   goals met: 26 of 47
58. (turn_to satellite5 planet79 phenomenon94)
   deleted: (pointing satellite5 phenomenon94)
   added: (pointing satellite5 planet79)
   goals met: 26 of 47
59. (take_image satellite5 planet79 instrument11 spectrograph1)
   added: (have_image planet79 spectrograph1)
   goals met: 27 of 47
60. (turn_to satellite5 star66 planet79)
   deleted: (pointing satellite5 planet79)
   added: (pointing satellite5 star66)
   goals met: 27 of 47
61. (take_image satellite5 star66 instrument11 spectrograph1)
   added: (have_image star66 spectrograph1)
   goals met: 28 of 47
62. (turn_to satellite5 star70 star66)
   deleted: (pointing satellite5 star66)
   added: (pointing satellite5 star70)
   goals met: 28 of 47
63. (take_image satellite5 star70 instrument11 spectrograph1)
   added: (have_image star70 spectrograph1)
   goals met: 29 of 47
64. (turn_to satellite5 star87 star70)
   deleted: (pointing satellite5 star70)
   added: (pointing satellite5 star87)
   goals met: 29 of 47
65. (take_image satellite5 star87 instrument11 spectrograph1)
   added: (have_image star87 spectrograph1)
   goals met: 30 of 47
66. (turn_to satellite5 star98 star87)
   deleted: (pointing satellite5 star87)
   added: (pointing satellite5 star98)
   goals met: 30 of 47
67. (take_image satellite5 star98 instrument11 spectrograph1)
   added: (have_image star98 spectrograph1)
   goals met: 31 of 47
68. (turn_to satellite3 star54 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 star54)
   goals met: 30 of 47
69. (calibrate satellite3 instrument7 star54)
   added: (calibrated instrument7)
   goals met: 30 of 47
70. (turn_to satellite3 groundstation44 star54)
   deleted: (pointing satellite3 star54)
   added: (pointing satellite3 groundstation44)
   goals met: 31 of 47
71. (turn_to satellite3 phenomenon104 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 phenomenon104)
   goals met: 30 of 47
72. (take_image satellite3 phenomenon104 instrument7 spectrograph2)
   added: (have_image phenomenon104 spectrograph2)
   goals met: 31 of 47
73. (turn_to satellite3 groundstation44 phenomenon104)
   deleted: (pointing satellite3 phenomenon104)
   added: (pointing satellite3 groundstation44)
   goals met: 32 of 47
74. (turn_to satellite3 phenomenon60 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 phenomenon60)
   goals met: 31 of 47
75. (take_image satellite3 phenomenon60 instrument7 spectrograph2)
   added: (have_image phenomenon60 spectrograph2)
   goals met: 32 of 47
76. (turn_to satellite3 groundstation44 phenomenon60)
   deleted: (pointing satellite3 phenomenon60)
   added: (pointing satellite3 groundstation44)
   goals met: 33 of 47
77. (turn_to satellite3 phenomenon74 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 phenomenon74)
   goals met: 32 of 47
78. (take_image satellite3 phenomenon74 instrument7 thermograph4)
   added: (have_image phenomenon74 thermograph4)
   goals met: 33 of 47
79. (turn_to satellite3 groundstation44 phenomenon74)
   deleted: (pointing satellite3 phenomenon74)
   added: (pointing satellite3 groundstation44)
   goals met: 34 of 47
80. (turn_to satellite3 phenomenon75 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 phenomenon75)
   goals met: 33 of 47
81. (take_image satellite3 phenomenon75 instrument7 spectrograph2)
   added: (have_image phenomenon75 spectrograph2)
   goals met: 34 of 47
82. (turn_to satellite3 groundstation44 phenomenon75)
   deleted: (pointing satellite3 phenomenon75)
   added: (pointing satellite3 groundstation44)
   goals met: 35 of 47
83. (turn_to satellite3 phenomenon86 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 phenomenon86)
   goals met: 34 of 47
84. (take_image satellite3 phenomenon86 instrument7 thermograph4)
   added: (have_image phenomenon86 thermograph4)
   goals met: 35 of 47
85. (turn_to satellite3 groundstation44 phenomenon86)
   deleted: (pointing satellite3 phenomenon86)
   added: (pointing satellite3 groundstation44)
   goals met: 36 of 47
86. (turn_to satellite3 planet100 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 planet100)
   goals met: 35 of 47
87. (take_image satellite3 planet100 instrument7 spectrograph2)
   added: (have_image planet100 spectrograph2)
   goals met: 36 of 47
88. (turn_to satellite3 groundstation44 planet100)
   deleted: (pointing satellite3 planet100)
   added: (pointing satellite3 groundstation44)
   goals met: 37 of 47
89. (turn_to satellite3 planet67 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 planet67)
   goals met: 36 of 47
90. (take_image satellite3 planet67 instrument7 thermograph4)
   added: (have_image planet67 thermograph4)
   goals met: 37 of 47
91. (turn_to satellite3 groundstation44 planet67)
   deleted: (pointing satellite3 planet67)
   added: (pointing satellite3 groundstation44)
   goals met: 38 of 47
92. (turn_to satellite3 planet71 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 planet71)
   goals met: 37 of 47
93. (take_image satellite3 planet71 instrument7 thermograph4)
   added: (have_image planet71 thermograph4)
   goals met: 38 of 47
94. (turn_to satellite3 groundstation44 planet71)
   deleted: (pointing satellite3 planet71)
   added: (pointing satellite3 groundstation44)
   goals met: 39 of 47
95. (turn_to satellite3 planet89 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 planet89)
   goals met: 38 of 47
96. (take_image satellite3 planet89 instrument7 thermograph4)
   added: (have_image planet89 thermograph4)
   goals met: 39 of 47
97. (turn_to satellite3 groundstation44 planet89)
   deleted: (pointing satellite3 planet89)
   added: (pointing satellite3 groundstation44)
   goals met: 40 of 47
98. (turn_to satellite3 planet99 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 planet99)
   goals met: 39 of 47
99. (take_image satellite3 planet99 instrument7 thermograph4)
   added: (have_image planet99 thermograph4)
   goals met: 40 of 47
100. (turn_to satellite3 groundstation44 planet99)
   deleted: (pointing satellite3 planet99)
   added: (pointing satellite3 groundstation44)
   goals met: 41 of 47
101. (turn_to satellite3 star103 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 star103)
   goals met: 40 of 47
102. (take_image satellite3 star103 instrument7 spectrograph2)
   added: (have_image star103 spectrograph2)
   goals met: 41 of 47
103. (turn_to satellite3 groundstation44 star103)
   deleted: (pointing satellite3 star103)
   added: (pointing satellite3 groundstation44)
   goals met: 42 of 47
104. (turn_to satellite3 star65 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 star65)
   goals met: 41 of 47
105. (take_image satellite3 star65 instrument7 thermograph4)
   added: (have_image star65 thermograph4)
   goals met: 42 of 47
106. (turn_to satellite3 groundstation44 star65)
   deleted: (pointing satellite3 star65)
   added: (pointing satellite3 groundstation44)
   goals met: 43 of 47
107. (turn_to satellite3 star82 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 star82)
   goals met: 42 of 47
108. (take_image satellite3 star82 instrument7 spectrograph2)
   added: (have_image star82 spectrograph2)
   goals met: 43 of 47
109. (turn_to satellite3 groundstation44 star82)
   deleted: (pointing satellite3 star82)
   added: (pointing satellite3 groundstation44)
   goals met: 44 of 47
110. (turn_to satellite3 star90 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 star90)
   goals met: 43 of 47
111. (take_image satellite3 star90 instrument7 thermograph4)
   added: (have_image star90 thermograph4)
   goals met: 44 of 47
112. (turn_to satellite3 groundstation44 star90)
   deleted: (pointing satellite3 star90)
   added: (pointing satellite3 groundstation44)
   goals met: 45 of 47
113. (turn_to satellite3 star96 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 star96)
   goals met: 44 of 47
114. (take_image satellite3 star96 instrument7 spectrograph2)
   added: (have_image star96 spectrograph2)
   goals met: 45 of 47
115. (turn_to satellite3 groundstation44 star96)
   deleted: (pointing satellite3 star96)
   added: (pointing satellite3 groundstation44)
   goals met: 46 of 47
116. (turn_to satellite3 star97 groundstation44)
   deleted: (pointing satellite3 groundstation44)
   added: (pointing satellite3 star97)
   goals met: 45 of 47
117. (take_image satellite3 star97 instrument7 thermograph4)
   added: (have_image star97 thermograph4)
   goals met: 46 of 47
118. (turn_to satellite3 groundstation44 star97)
   deleted: (pointing satellite3 star97)
   added: (pointing satellite3 groundstation44)
   goals met: 47 of 47
